# Excercise -2 (sqlite3)

In [1]:
import sqlite3

Adding date in table

In [3]:
db=sqlite3.connect('C:/MySQLite_DataBase/sports_databse.db')

In [4]:
cur=db.cursor()

# Constraints

Unique.........enter ony unique values,no dublicate value
not null...........no blank value can be inserted

In [5]:
cur.execute('create table sport (id int primary key,sportname text unique,dateofevent date,country text not null)')

In [7]:
cur.execute('insert into sport values(1,"cricket","2021-10-9","england")')

In [8]:
cur.execute('insert into sport values(2,"tennis","2018-9-10","srilanka")')

In [9]:
print(cur.rowcount,'records inserted')

1 records inserted

In [10]:
res=cur.execute('select * from sport')
res.fetchall()

[(1, 'cricket', '2021-10-9', 'england'),
 (2, 'tennis', '2018-9-10', 'srilanka')]

In [11]:
cur.execute('insert into sport values(3,"football","2017-8-10","Australia")')
db.commit;

In [12]:
res=cur.execute('select * from sport')
res.fetchall()

[(1, 'cricket', '2021-10-9', 'england'),
 (2, 'tennis', '2018-9-10', 'srilanka'),
 (3, 'football', '2017-8-10', 'Australia')]

# Employee database with DB and Python programmatically

In [37]:
import sqlite3

In [38]:
con=sqlite3.connect('C:/MySQLite_DataBase/emp_database.db')

In [67]:
def sql_table(con):
    cur=con.cursor()
    cur.execute('create table employee6(id int primary key,name text,salary real,department text,position text,hirdate date)')
    con.commit()

In [68]:
# calling function

sql_table(con)

In [69]:
cur=con.cursor()

cur.execute('insert into employee6 values(1,"jack",9000,"HR","Manager",2019-07-09)')
con.commit;

In [43]:
# calling function

#sql_table(con)

In [70]:
res=cur.execute('select * from employee6')
res.fetchall()

[(1, 'jack', 9000.0, 'HR', 'Manager', 2003)]

you can also pass the values/arguments to an insert statment in the execute()method. you can use the question mark (?) as a placeholder for each value.the syntext of the insert will be the like following.

cur.execute(insert into employee(id,name,salary,department,position,hiredate)values(?,?,?,?,?,?),entities)

entities=(2,'jack',4000,'IT','Engineer',2018-02-06)

In [79]:
def sql_insert(con,entities):
    cur=con.cursor()
    cur.execute('insert into employee6(id,name,salary,department,position,hirdate) values(?,?,?,?,?,?)',entities)

In [80]:
entities=(2,"andrew",7000,"it","engineer","2015-04-06")

In [81]:
# calling function sql_insert to insert the data

sql_insert(con,entities)

In [82]:
res=cur.execute('select * from employee6')
res.fetchall()

[(1, 'jack', 9000.0, 'HR', 'Manager', 2003),
 (2, 'andrew', 7000.0, 'it', 'engineer', '2015-04-06')]

In [83]:
def sql_insert(con,entities):
    cur=con.cursor()
    cur.execute('insert into employee6(id,name,salary,department,position,hirdate) values(?,?,?,?,?,?)',entities)

In [84]:
entities=(3,"Thomas",6000,"HR","Manager","2016-06-04")

In [85]:
sql_insert(con,entities)

In [86]:
res=cur.execute('select * from employee6')
res.fetchall()

[(1, 'jack', 9000.0, 'HR', 'Manager', 2003),
 (2, 'andrew', 7000.0, 'it', 'engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-04')]

In [87]:
res=cur.execute('select id,name from employee6')
res.fetchall()

[(1, 'jack'), (2, 'andrew'), (3, 'Thomas')]

# Aggregate function

In [89]:
res=cur.execute('select id,name from employee6 where department in("HR")')
res.fetchall()

[(1, 'jack'), (3, 'Thomas')]

In [90]:
res=cur.execute('select MIN(salary) from employee6')
res.fetchall()

[(6000.0,)]

In [91]:
res=cur.execute('select MAX(salary) from employee6')
res.fetchall()

[(9000.0,)]

In [92]:
res=cur.execute('select Count(id) from employee6')
res.fetchall()

[(3,)]

In [93]:
res=cur.execute('select distinct(department) from employee6')
res.fetchall()

[('HR',), ('it',)]

In [94]:
res=cur.execute('select count(distinct(department)) from employee6')
res.fetchall()

[(2,)]

In [96]:
res=cur.execute('select sum(salary),position from employee6 group by position')
res.fetchall()

[(15000.0, 'Manager'), (7000.0, 'engineer')]

In [97]:
res=cur.execute('select sum(salary),department from employee6 group by department')
res.fetchall()

[(15000.0, 'HR'), (7000.0, 'it')]

In [107]:
def sql_query(sql):
    cur=con.cursor()
    results=cur.execute(sql)
    return results

In [108]:
# make query

sql="select * from employee6"

# pass query in function

respond=sql_query(sql)
respond.fetchall()

[(1, 'jack', 9000.0, 'HR', 'Manager', 2003),
 (2, 'andrew', 7000.0, 'it', 'engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-04')]

# Sqlite3 Executemany (Bulk insert)

You can use the executemany statment for bulk insert multiple rows at once

In [109]:
entities=[(4,'joseph',4000,'Account','CA','2016-12-05'),(5,'maria',10000,'sales','executive','2020-06-05')]

In [112]:
cur.executemany('insert into employee6(id,name,salary,department,position,hirdate) values(?,?,?,?,?,?)',entities)

In [113]:
res=cur.execute('select * from employee6')
res.fetchall()

[(1, 'jack', 9000.0, 'HR', 'Manager', 2003),
 (2, 'andrew', 7000.0, 'it', 'engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-04'),
 (4, 'joseph', 4000.0, 'Account', 'CA', '2016-12-05'),
 (5, 'maria', 10000.0, 'sales', 'executive', '2020-06-05')]

In [114]:
con.close()

# Referential integrity

Foreign keys = A foreign key is a set of attributes in a table that refers to the primary key of another table. The foreign key links these two tables

In [1]:
import sqlite3

In [2]:
db=sqlite3.connect('C:/MySQLite_DataBase/student_course_database.db')

In [3]:
cur=db.cursor()

In [6]:
cur.execute('create table course2(courseid int primary key,coursename text,duration int)')

In [9]:
cur.execute('create table student7(roll_no int primary key,studentname text,age int,courseid int,foreign key(courseid)references course(courseid))')

In [14]:
cur.execute('insert into course2 values(78,"data science",12),(56,"python course",4),(101,"database",7)')

print(cur.rowcount,"records inserted")

db.commit;

3 records inserted

In [11]:
cur.execute('insert into student7 values(1,"jack",22,78),(2,"john",21,56),(3,"rodoif",18,78),(4,"jim",21,56)')

print(cur.rowcount,"records inserted")

db.commit;

4 records inserted

In [12]:
res=cur.execute('select * from student7')

res.fetchall()

[(1, 'jack', 22, 78),
 (2, 'john', 21, 56),
 (3, 'rodoif', 18, 78),
 (4, 'jim', 21, 56)]

In [15]:
res=cur.execute('select * from course2')

res.fetchall()

[(78, 'data science', 12), (56, 'python course', 4), (101, 'database', 7)]

In [16]:
res=cur.execute('select courseid from course2 where coursename = "data science"')

res.fetchall()

[(78,)]

# subquery - inner query, outer query

In [18]:
res=cur.execute('select * from student7 where courseid=(select courseid from course2 where coursename="data science")')
res.fetchall()

[(1, 'jack', 22, 78), (3, 'rodoif', 18, 78)]

In [19]:
res=cur.execute('select * from student7 where courseid=(select courseid from course2 where coursename="python course")')
res.fetchall()

[(2, 'john', 21, 56), (4, 'jim', 21, 56)]

# Join

different types of sql joins


inner join -inner join returns records that have matching values in both table
left join - returns all records from the left table. and the matched records from the right table
right join- returns all records from the right table. and the matched records from the left table
full outer join - returns all records when there is a match in either left or right table

# Inner join

In [23]:
sql='select student7.roll_no, student7.studentname, course2.courseid, course2.coursename from student7 inner join course2 on student7.courseid=course2.courseid'

results=cur.execute(sql)
results.fetchall()

[(1, 'jack', 78, 'data science'),
 (2, 'john', 56, 'python course'),
 (3, 'rodoif', 78, 'data science'),
 (4, 'jim', 56, 'python course')]

# Left join

In [24]:
sql="select student7.roll_no,student7.studentname, course2.courseid, course2.coursename from student7 left join course2 on student7.courseid=course2.courseid"

results=cur.execute(sql)

results.fetchall()

[(1, 'jack', 78, 'data science'),
 (2, 'john', 56, 'python course'),
 (3, 'rodoif', 78, 'data science'),
 (4, 'jim', 56, 'python course')]

In [25]:
sql="select student7.roll_no,student7.studentname, course2.courseid, course2.coursename from course2 left join student7 on course2.courseid=student7.courseid"

results=cur.execute(sql)

results.fetchall()

[(1, 'jack', 78, 'data science'),
 (3, 'rodoif', 78, 'data science'),
 (2, 'john', 56, 'python course'),
 (4, 'jim', 56, 'python course'),
 (None, None, 101, 'database')]

# Right join and full outer join is not supported in sqlite